# https://github.com/Homebrew/homebrew-bundle

tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/services'

tap 'koekeishiya/formulae'

brew 'awscli'
brew 'bat'
brew 'btop'
brew 'checkov'
brew 'cmake'
brew 'colima'
brew 'coreutils'
brew 'curl'
brew 'docker'
brew 'duf'
brew 'exa'
brew 'fd'
brew 'fzf'
brew 'git'
brew 'git-delta'
brew 'git-lfs'
brew 'glab'
brew 'gnupg'
brew 'goenv'
brew 'helm'
brew 'helmfile'
brew 'hub'
brew 'jq'
brew 'k9s'
brew 'kind'
brew 'kubernetes-cli'
brew 'kubectx'
brew 'lesspipe'
brew 'lftp'
brew 'libarchive'
brew 'mas'
brew 'node'
brew 'numpy'
brew 'openssh'
brew 'pinentry'
brew 'pinentry-mac'
brew 'procs'
brew 'pwgen'
brew 'pyenv'
brew 'python'
brew 'rbenv'
brew 'ripgrep'
brew 'ruby'
brew 'shellcheck'
brew 'sipcalc'
brew 'skhd'
brew 'terraform-docs'
brew 'terraform-ls'
brew 'tfenv'
brew 'tfsec'
brew 'tflint'
brew 'tmux'
brew 'vim'
brew 'wget'
brew 'xh'
brew 'xsv'
brew 'xz'
brew 'yabai'
brew 'yadm'
brew 'yamllint'
brew 'yarn'
brew 'ykman'
brew 'yq'
brew 'zsh'

cask '1password-cli'
cask 'font-fira-code'
cask 'font-fira-code-nerd-font'
cask 'font-fira-mono'
cask 'font-fira-sans'
cask 'font-noto-mono'
cask 'font-noto-sans'
cask 'google-cloud-sdk'
cask 'secretive'
cask 'wezterm'

local_brewfile=File.join(ENV['HOME'], '.config', 'homebrew', 'Brewfile.local')
eval(IO.read(local_brewfile), binding) if File.exist?(local_brewfile)
