# https://github.com/Homebrew/homebrew-bundle

tap 'homebrew/services'
tap 'koekeishiya/formulae'
tap 'nikitabobko/tap'
tap 'norwoodj/tap'

brew 'awscli'
brew 'bat'
brew 'bat-extras'
brew 'btop'
brew 'checkov'
brew 'cmake'
brew 'colima'
brew 'coreutils'
brew 'curl'
brew 'docker'
brew 'docker-buildx'
brew 'dog'
brew 'duf'
brew 'eza'
brew 'fd'
brew 'fish'
brew 'fx'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'git-delta'
brew 'git-lfs'
brew 'gitleaks'
brew 'glab'
brew 'gnupg'
brew 'goenv'
brew 'helm'
brew 'helm-docs'
brew 'helmfile'
brew 'hub'
brew 'ipcalc'
brew 'jq'
brew 'k9s'
brew 'kind'
brew 'kubernetes-cli'
brew 'kubectx'
brew 'less'
brew 'lesspipe'
brew 'lftp'
brew 'libarchive'
brew 'markdownlint-cli'
brew 'mas'
brew 'mise'
brew 'neofetch'
brew 'node'
brew 'numpy'
brew 'openssh'
brew 'pinentry'
brew 'pinentry-mac'
brew 'procs'
brew 'pwgen'
brew 'pyenv'
brew 'python'
brew 'python-setuptools'
brew 'rbenv'
brew 'ripgrep'
brew 'ruby'
brew 'shellcheck'
brew 'shfmt'
brew 'sipcalc'
brew 'skhd'
brew 'starship'
brew 'terraform-docs'
brew 'terraform-ls'
brew 'tfsec'
brew 'tflint'
brew 'tmux'
brew 'vim'
brew 'wget'
brew 'xh'
brew 'xsv'
brew 'xz'
brew 'yabai'
brew 'yadm'
brew 'yamllint'
brew 'yarn'
brew 'ykman'
brew 'yq'
brew 'zsh'

cask '1password'
cask '1password-cli'
cask 'aerospace'
cask 'alfred'
cask 'discord'
cask 'firefox'
cask 'font-fira-code'
cask 'font-fira-code-nerd-font'
cask 'font-fira-mono'
cask 'font-fira-sans'
cask 'font-monaspace'
cask 'font-monaspace-nerd-font'
cask 'font-noto-color-emoji'
cask 'font-noto-emoji'
cask 'font-noto-mono'
cask 'font-noto-nerd-font'
cask 'font-noto-sans'
cask 'font-noto-serif'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'iterm2'
cask 'little-snitch'
cask 'logi-options+'
cask 'logitune'
cask 'nordvpn'
cask 'obsidian'
cask 'secretive'
cask 'slack'
cask 'spotify'
cask 'vivaldi'
cask 'vlc'
cask 'wacom-tablet'
cask 'wezterm'
cask 'zoom'

local_brewfile=File.join(ENV['HOME'], '.config', 'homebrew', 'Brewfile.local')
eval(IO.read(local_brewfile), binding) if File.exist?(local_brewfile)

# vim:ft=brewfile:
